// Título: Configuración de Reglas de Tráfico
// Fecha: 25/2/2026, 13:19:05
// Descarga este archivo al directorio de tu proyecto (reemplazando el anterior) para guardar los cambios.

const PRELOADED_RULES = [
    {
        "id": 1771866107205,
        "lat": 39.763030807267924,
        "lng": 2.7145064052841805,
        "type": "forbidden",
        "angle": 187
    },
    {
        "id": 1772019357625,
        "lat": 39.76683254464947,
        "lng": 2.720158576237655,
        "type": "forbidden",
        "angle": 72
    },
    {
        "id": 1772019401323,
        "lat": 39.76632919439706,
        "lng": 2.718948663678194,
        "type": "forbidden",
        "angle": 174
    },
    {
        "id": 1772020034203,
        "lat": 39.768223462223695,
        "lng": 2.7123146407581893,
        "type": "forbidden",
        "angle": 150
    },
    {
        "id": 1772020328660,
        "lat": 39.76640570061811,
        "lng": 2.714401141072833,
        "type": "forbidden",
        "angle": 251
    },
    {
        "id": 1772020371720,
        "lat": 39.764399441226985,
        "lng": 2.7134519408669178,
        "type": "forbidden",
        "angle": 40
    },
    {
        "id": 1772020471547,
        "lat": 39.7655915631303,
        "lng": 2.7181117573568696,
        "type": "forbidden",
        "angle": 265
    },
    {
        "id": 1772020511249,
        "lat": 39.764630226140525,
        "lng": 2.7189460873036397,
        "type": "forbidden",
        "angle": 241
    },
    {
        "id": 1772020623686,
        "lat": 39.76690780968506,
        "lng": 2.7188216751129306,
        "type": "forbidden",
        "angle": 164
    },
    {
        "id": 1772020697888,
        "lat": 39.76690780968506,
        "lng": 2.719948422951002,
        "type": "forbidden",
        "angle": 355
    },
    {
        "id": 1772020718400,
        "lat": 39.7678567376399,
        "lng": 2.7195594266735728,
        "type": "forbidden",
        "angle": 283
    },
    {
        "id": 1772020735791,
        "lat": 39.76793512675566,
        "lng": 2.7185346226875016,
        "type": "forbidden",
        "angle": 270
    },
    {
        "id": 1772020865079,
        "lat": 39.76846543560911,
        "lng": 2.7238245060157955,
        "type": "forbidden",
        "angle": 264
    },
    {
        "id": 1772021023516,
        "lat": 39.76781768973182,
        "lng": 2.717860808754971,
        "type": "forbidden",
        "angle": 248
    },
    {
        "id": 1772021044969,
        "lat": 39.76727102600133,
        "lng": 2.717090864398939,
        "type": "forbidden",
        "angle": 153
    },
    {
        "id": 1772021180739,
        "lat": 39.76659502292416,
        "lng": 2.71262568531566,
        "type": "forbidden",
        "angle": 331
    },
    {
        "id": 1772021228874,
        "lat": 39.76621744984992,
        "lng": 2.7128966413433946,
        "type": "forbidden",
        "angle": 332
    },
    {
        "id": 1772021360764,
        "lat": 39.76402062271145,
        "lng": 2.7181885815732176,
        "type": "forbidden",
        "angle": 141
    },
    {
        "id": 1772021460814,
        "lat": 39.7658919028174,
        "lng": 2.717024598216558,
        "type": "forbidden",
        "angle": 63
    },
    {
        "id": 1772021545916,
        "lat": 39.76745889671263,
        "lng": 2.718711629096951,
        "type": "forbidden",
        "angle": 355
    },
    {
        "id": 1772021694356,
        "lat": 39.76564233859011,
        "lng": 2.7187249563127622,
        "type": "forbidden",
        "angle": 267
    },
    {
        "id": 1772021827060,
        "lat": 39.76385081349948,
        "lng": 2.712826904956849,
        "type": "forbidden",
        "angle": 40
    }
];
