// Título: Configuración de Reglas de Tráfico
// Fecha: 21/2/2026, 17:30:15
// Descarga este archivo al directorio de tu proyecto (reemplazando el anterior) para guardar los cambios.

const PRELOADED_RULES = [
    {
        "angle": 150,
        "id": 1770999363196,
        "lat": 39.76841579441031,
        "lng": 2.712155776850041,
        "type": "forbidden"
    },
    {
        "angle": 324,
        "id": 1770999496196,
        "lat": 39.76600981484652,
        "lng": 2.713010073930198,
        "type": "forbidden"
    },
    {
        "angle": 254,
        "id": 1770999598198,
        "lat": 39.76648400770265,
        "lng": 2.714645369198197,
        "type": "forbidden"
    },
    {
        "angle": 43,
        "id": 1770999666815,
        "lat": 39.76371921119144,
        "lng": 2.712682922007366,
        "type": "forbidden"
    },
    {
        "angle": 162,
        "id": 1771592511930,
        "lat": 39.76936208210008,
        "lng": 2.7149990200996403,
        "type": "forbidden"
    },
    {
        "angle": 42,
        "id": 1771592611526,
        "lat": 39.76428001409013,
        "lng": 2.7133172750473022,
        "type": "forbidden"
    },
    {
        "angle": 148,
        "id": 1771592663919,
        "lat": 39.76530058117523,
        "lng": 2.7156239748001103,
        "type": "forbidden"
    },
    {
        "angle": 153,
        "id": 1771592672720,
        "lat": 39.76551500142774,
        "lng": 2.7155220508575444,
        "type": "forbidden"
    },
    {
        "angle": 58,
        "id": 1771592738472,
        "lat": 39.765809828184594,
        "lng": 2.7167853713035583,
        "type": "forbidden"
    },
    {
        "angle": 261,
        "id": 1771592885065,
        "lat": 39.76566138410117,
        "lng": 2.7188909053802495,
        "type": "forbidden"
    },
    {
        "angle": 160,
        "id": 1771593003388,
        "lat": 39.76642421834857,
        "lng": 2.718923091888428,
        "type": "forbidden"
    },
    {
        "angle": 166,
        "id": 1771593032732,
        "lat": 39.767092206802616,
        "lng": 2.7187836170196538,
        "type": "forbidden"
    },
    {
        "angle": 344,
        "id": 1771593115749,
        "lat": 39.76682624921314,
        "lng": 2.719966471195221,
        "type": "forbidden"
    },
    {
        "angle": 77,
        "id": 1771593160551,
        "lat": 39.76679944722854,
        "lng": 2.7200227975845337,
        "type": "forbidden"
    },
    {
        "angle": 266,
        "id": 1771593323173,
        "lat": 39.76786121017663,
        "lng": 2.719700932502747,
        "type": "forbidden"
    },
    {
        "angle": 269,
        "id": 1771593459885,
        "lat": 39.767943676516424,
        "lng": 2.7186897397041325,
        "type": "forbidden"
    },
    {
        "angle": 251,
        "id": 1771593518123,
        "lat": 39.76787151847451,
        "lng": 2.7179896831512456,
        "type": "forbidden"
    },
    {
        "angle": 334,
        "id": 1771593677815,
        "lat": 39.76638710768886,
        "lng": 2.7127754688262944,
        "type": "forbidden"
    },
    {
        "id": 1771688729895,
        "lat": 39.76506356470231,
        "lng": 2.717178453406266,
        "type": "forbidden",
        "angle": 316
    },
    {
        "id": 1771688745018,
        "lat": 39.76380308684629,
        "lng": 2.718399096897511,
        "type": "forbidden",
        "angle": 325
    },
    {
        "id": 1771688772001,
        "lat": 39.76559993125941,
        "lng": 2.718235450187688,
        "type": "forbidden",
        "angle": 263
    },
    {
        "id": 1771691340525,
        "lat": 39.76849219886582,
        "lng": 2.724020411804947,
        "type": "forbidden",
        "angle": 273
    }
];
